smt-aws-lambda-soap-stub-parent/smt-aws-lambda-soap-stub/src/test/resources/soup-with-empty-header.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:exampleMethod xmlns:ns2="http://example.stub.soap.lambda.aws.vector.co.nz/">
            <argument1>
                <value>fMeSRkqC</value>
            </argument1>
            <argument2>
                <value>Njju85exfJ7Wv</value>
                <argument3>
                    <value>IA2X6MraKzHofdyhUg3DX</value>
                </argument3>
            </argument2>
        </ns2:exampleMethod>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>